Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: You can request a new takeout of your recordings every { $days } days.
ug: سىز ھەر { $days } كۈندە يېڭى ئۈن خاتىرىلىرىڭىزنى تەلەپ قىلالايسىز.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
ug: كىشىلەرنىڭ تۆھپە قوشۇشىغا ياردەم بېرىش ئۈچۈن پائالىيەت ئېلىپ بارالايسىز. ئۇ سىز ئويلىغاندىنمۇ ئاسان. ئۇنى توردا سىنلىق يىغىن قورالى ئارقىلىق ياكى بىخەتەر بولسا بىۋاسىتە ئېلىپ بارسىڭىزمۇ بولىدۇ. <eventTemplate>پائالىيەت ئۇيۇشتۇرۇش ھەققىدىكى قېلىپ ۋە مەنبەلىرىمىزنى تەكشۈرۈڭ</eventTemplate>

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
ug: سىز <sentenceCollectorLinkAdd>ئاز ساندىكى جۈملىلەرنى قوشالايسىز </sentenceCollectorLinkAdd>، ياكى Github </bulkImportDocsLink> نى ئىشلىتىپ <bulkImportDocsLink> توپ ئەكىرەلەيسىز. ئېسىڭىزدە بولسۇنكى، جۈملىلەر <licenseLink> CC0 (ياكى ئاممىۋى دائىرە) </licenseLink> دە بولۇشى ياكى ئۆزىڭىز يازسىڭىز بولىدۇ.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
ug: سىز <scraperLink>جۈملە چىقارغۇچ</scraperLink> نى ئىشلىتىپ Wikipedia دىن قىسقا جۈملىلەرنى توپلىيالايسىز.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
ug: تور بېكەتنى ئىچىگە ئالالايسىز، مەسىلەن، «Common Voice - https://commonvoice.mozilla.org/»

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
ug: سىز ئىلمىي پايدىلىنىش ئۇسلۇبىنى ئىشلىتەلەيسىز، مەسىلەن خارۋارد ئۇسلۇبىدىكى «Mozilla (2021) Common Voice. https://commonvoice.mozilla.org/ (Accessed: 15th September 2021) دىن پايدىلانسىڭىز بولىدۇ:

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
ug: ئۇچۇرنى يەتكۈزۈشتە ئىجتىمائىي ئالاقە سۇپىلىرىدىن پايدىلانسىڭىز بولىدۇ. بۇنىڭ نېمە ئۈچۈن مۇھىملىقىنى چۈشەندۈرۈپ بېرىدىغان يازمىلارنى ھەمبەھىرلەڭ ھەمدە تىل ھوقۇقى، ئاۋازلىق سۈنئىي ئەقىل ياكى تېخنىكىدىكى بىر تەرەپلىمە قاراش قاتارلىق مەسىلىلەر توغرىسىدا باشقىلار بىلەن پاراڭلىشىپ تۇرۇڭ. <campaignLink>سىز قايتا ئىشلىتەلەيدىغان مەزمۇنلارنى ئۆز ئىچىگە ئالغان ئىجتىمائىي پائالىيەت ئورۇنلاشتۇرۇش ھەققىدە</campaignLink> تېخىمۇ كۆپ تەكلىپلەرنى كۆرۈڭ.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
ug: سىز ھېچقانداق تىل تاللىمىدىڭىز. <profileLink> تەرجىمىھال</profileLink> ىڭىزغا كىرىپ تىل تاللاڭ.

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
ug: بۇ بەتنىڭ تاپشۇرۇش چېكىگە يەتتىڭىز. باشقا جۈملە يوللاشتىن بۇرۇن { $retryLimit } مىنۇت كۈتۈڭ. سەۋر قىلغانلىقىڭىزغا رەھمەت!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
ug: بۇ بەتنىڭ تاپشۇرۇش چېكىگە يەتتىڭىز. باشقا جۈملە يوللاشتىن بۇرۇن { $retryLimit } سېكۇنت كۈتۈڭ. سەۋر قىلغانلىقىڭىزغا رەھمەت!

source: You must allow microphone access.
ug: مىكروفون زىيارىتىگە يول قويۇشىڭىز كېرەك.

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
ug: ئۈن خاتىرىنىڭ ھەر بىر سۆزىنى ئاڭلىيالىشىڭىز كېرەك. بىز ماشىنا ئۆگىنىش ھېسابلاش ئۇسۇلىنىڭ ھەر خىل مۇھىت شاۋقۇنىنى بىر تەرەپ قىلىشىنى ئۈمىد قىلىمىز، ئەگەر ئۇلار تېكىستنىڭ تولۇق ئاڭلىنىشىنى توسمىسا، ھەتتا بىر قەدەر يۇقىرى ئاۋاز ياكى بوش تەڭكەش نەغمىنى قوبۇل قىلسىڭىز بولىدۇ، تېكىستنى ئاڭلىشىڭىزغا توسالغۇ بولىدىغان ۋاراڭ-چۇرۇڭ ياكى «شاۋقۇن-سۆرەن» بولسا ئۇن خاتىرىسىنى رەت قىلىشىڭىز كېرەكلىكىنى كۆرسىتىدۇ.

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
ug: تەلەپپۇزىڭىز سىزنىڭ سۆزلەرنى قايسى يوسۇندا تەلەپپۇز قىلىش ئۇسۇلىڭىز. ئۇ سىز ياشىغان جاي، سىز سۆزلەيدىغان باشقا تىل قاتارلىق باشقا نۇرغۇن ئامىللارنىڭ تەسىىرگە ئۇچرىغان بولىدۇ. بۇنىڭغا مۇناسىۋەتلىك دەپ قارىغان ئۇچۇرلارنى بۇ يەردە ئورتاقلىشالايسىز.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
ug: نامسىز ئۈن خاتىرىڭىز Common Voice سانلىق مەلۇمات ئامبىرىدا ساقلىنىپ قالىدۇ. تەرجىمىھالىڭىزنى ئۆچۈرۈۋەتكەندىن كېيىن ئۈن خاتىرىڭىزنى ئۆچۈرۈۋېتىش ئىلتىماسىنى يوللىيالمايسىز

source: Your daily goal has been created
ug: كۈندىلىك نىشانىڭىز بېكىتىلدى.

source: Your dataset is downloading!
ug: سانلىق مەلۇمات توپلىمىڭىز چۈشۈۋاتىدۇ!

source: Your download has started.
ug: چۈشۈرۈشىڭىز باشلاندى.

source: You’re contributing to a target segment
ug: سىز بىر نىشان بۆلىكىگە تۆھپە قوشۇۋاتىسىز

source: You’re contributing to our first target segment
ug: سىز تۇنجى نىشان بۆلىكىگە تۆھپە قوشىۋاتىسىز

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ug: سىز ھازىر نىشان ئەسكەرتىشلىرى ، ئىلگىرىلەش ئۇچۇرلىرى ۋە Common Voice توغرىسىدىكى خەۋەرلەرنى ئېلېكترونلۇق خەت ئارقىلىق تاپشۇرۇۋېلىش ھالىتىدە <bold>ئەمەس</bold>

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ug: سىز ھازىر نىشان ئەسكەرتىشلىرى ، ئىلگىرىلەش ئۇچۇرلىرى ۋە Common Voice توغرىسىدىكى خەۋەرلەرنى ئېلېكترونلۇق خەت ئارقىلىق تاپشۇرۇۋېلىش ھالىتىدە

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
ug: بەك ئالدىراقسانلىق قىلماڭ. كۆپرەك ۋاقىت ئاجرىتىپ جۈملىنىڭ توغرا ئىكەنلىكىنى جەزملەشتۈرۈڭ.

source: You're helping Common Voice reach our daily sentence goals!
ug: سىز Common Voice نىڭ كۈندىلىك جۈملە نىشانىغا يېتىشىمىزگە ياردەم قىلىۋاتىسىز!

source: Your email address
ug: ئېلخەت ئادرېسىڭىز

source: Your files are being assembled. Please check again later.
ug: ماتىرياللىرىڭىز رەتلىنىۋاتىدۇ، سەل تۇرۇپ قايتا سىناڭ.

source: Your Languages
ug: سىزنىڭ تىلىڭىز

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
ug: تىل شېۋىڭىزنىڭ ئۈن ئۈزۈندىلىرى بىر تەرەپ قىلىنىپ بولغان بولۇشى مۇمكىن، ئەگەر قۇلاي بولسا، تەڭشىكىڭىزنى ئۆزگەرتىپ تىلىڭىزدىكى باشقا جۈملىلەرنى كۆرۈڭ.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
ug: تىل شېۋىڭىزنىڭ جۈملىلىرى بىر تەرەپ قىلىنىپ بولغان بولۇشى مۇمكىن، ئەگەر قۇلاي بولسا، تەڭشىكىڭىزنى ئۆزگەرتىپ تىلىڭىزدىكى باشقا جۈملىلەرنى كۆرۈڭ.

source: Your username and email will not be associated with the published data.
ug: ئىشلەتكۈچى ئىسمىڭىز ۋە ئېلخەتلىرىڭىز ئېلان قىلىنغان سانلىق مەلۇماتلار بىلەن باغلانمايدۇ.

source: Your weekly goal has been created
ug: ھەپتىلىك نىشانىڭىز بېكىتىلدى.

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
ug: قىسقا ۋاقىت ئىچىدە تىلىڭىزنى Common Voice قا قوشۇشنىڭ قەدەم باسقۇچلىرى ھەققىدىكى ئېلخەت تاپشۇرۇۋېلىشىڭىز كېرەك.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
ug: Common Voice دىكى كۈندىلىك { $goalValue } ئۈن خاتىرە نىشانىمىزنىڭ <goalPercentage></goalPercentage> كە يېتىشىگە ياردەم بەردىڭىز!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
ug: Common Voice نىڭ بىزنىڭ كۈندىلىك { $goalValue } دەلىللەش نىشانىمىزنىڭ <goalPercentage></goalPercentage> غا يىتىشىگە ياردەم بەردىڭىز!

source: You've successfully signed up for contributing to { $language }. Thank you.
ug: سىز { $language } غا تۆھپە قوشۇش ئۈچۈن مۇۋەپپەقىيەتلىك تىزىملاتتىڭىز. رەھمەت سىزگە.

source: You want to join the Common Voice mailing list
ug: مەن Common Voice نىڭ ئېلخەت تىزىمىغا قوشۇلماقچى

source: Zaza
ug: زازاچە

source: Zip #{ $offset } of { $total }
ug: { $total } دانە Zip ھۆججىتىنىڭ { $offset }چىسى

source: Zulu
ug: زۇلۇچە

source: 1 add-on
ug: 1 قىستۇرما

source: %1$d new permissions are required
ug: %1$dدانە يېڭى ھوقۇق تەلەپ قىلىدۇ

source: %1$d out of %2$d
ug: %1$d/%2$d

source: %1$d selected
ug: %1$d تاللاندى

source: 1 extension
ug: 1 كېڭەيتمە

source: 1. Go to Android Settings
ug: 1. ئاندىرويىد تەڭشىكىگە يۆتكىلىڭ

source: 1 open tab. Tap to switch tabs.
ug: 1 بەتكۈچ ئوچۇق. بەتكۈچنى ئالماشتۇرۇش ئۈچۈن چېكىڭ.

source: %1$s, %2$d of %3$d
ug: %1$s، %2$d / %3$d

source: %1$s add-ons
ug: %1$s قىستۇرما

source: %1$s automatically tries to reject cookie requests on cookie banners.
ug: %1$s ئۆزلۈكىدىن cookie لوزۇنكىسىنىڭ cookie ئىلتىماسىنى رەت قىلىشنى سىنايدۇ.

source: %1$s can automatically reject many cookie banner requests.
ug: %1$s نۇرغۇن cookie لوزۇنكا تەلىپىنى ئاپتوماتىك رەت قىلالايدۇ.

source: %1$s can close tabs you haven’t viewed over the past month.
ug: %1$s بىر ئايغىچە كۆرمىگەن بەتكۈچلەرنى ئاپتوماتىك ياپىدۇ.

source: %1$s can’t automatically reject cookie requests on this site. You can send a request to support this site in the future.
ug: %1$s بۇ تور بېكەتنىڭ ساقلانما ئىلتىماسىنى ئۆزلۈكىدىن رەت قىلالمايدۇ. كەلگۈسىدە بۇ تور بېكەتنى قوللاش ئىلتىماسىنى ئەۋەتسىڭىز بولىدۇ.

source: %1$s can’t download this file type
ug: %1$s بۇ تىپتىكى ھۆججەتنى چۈشۈرەلمەيدۇ

source: %1$s clears your search and browsing history from private tabs when you close them or quit the app. While this doesn’t make you anonymous to websites or your internet service provider, it makes it easier to keep what you do online private from anyone else who uses this device.
ug: ئەپنى تاقىغان تياكى چېكىنگەندە %1$s شەخسىي بەتكۈچلەردىن ئىزدەش ۋە زىيارەت تارىخىڭىزنى تازىلايدۇ. گەرچە بۇ سىزنى تور بېكەت ياكى ئىنتېرنېت مۇلازىمەت تەمىنلىگۈچىڭىزگە نىسبەتەن ئاتسىز قىلمىسىمۇ ئەمما توردا نېمە ئىش قىلغانلىقىڭىزنى مەزكۇر ئۈسكۈنىنى ئىشلىتىدىغان باشقا كىشىلەردىن سىر تۇرۇشنى ئاسانلاشتۇرىدۇ.

source: %1$s could not be installed because it can only be installed by an organization using enterprise policies, which isn‘t supported on this platform.
ug: %1$s نى ئورنىتالمايدۇ چۈنكى ئۇنى پەقەت كارخانا تۈزۈمىنى قوللانغان ئورگانلارلا ئورنىتالايدۇ، بۇ سۇپىنى قوللىمايدۇ.

source: %1$s could not be installed because it has a high risk of causing stability or security problems
ug: %1$s ئورنىتالمايدۇ چۈنكى ئۇنىڭ مۇقىملىق ياكى بىخەتەرلىق مەسىلىسى كەلتۈرۈپ چىقىرىش خەۋپى يۇقىرى

source: %1$s could not be installed because it has a high risk of causing stability or security problems.
ug: %1$s ئورنىتالمايدۇ چۈنكى ئۇنىڭ مۇقىملىق ياكى بىخەتەرلىق مەسىلىسى كەلتۈرۈپ چىقىرىش خەۋپى يۇقىرى.

source: %1$s could not be installed because it is not compatible with %2$s %3$s.
ug: %1$s ئورنىتالمايدۇ چۈنكى ئۇ %2$s %3$s بىلەن ماسلاشمايدۇ.

source: %1$s could not be verified as secure and has been disabled.
ug: %1$s بىخەتەر دەپ دەلىللەنمىگەچكە چەكلەندى.

source: %1$s could not verify the authenticity of the application. Do you want to proceed with autofilling the selected credentials?
ug: %1$s ئەپنىڭ چىنلىقىنى دەلىللىيەلمىدى. ئۆزلۈكىدىن تولدۇرۇلۇپ تاللانغان تىزىمغا كىرىش ئۇچۇرىنى داۋاملاشتۇرامسىز؟

source: %1$s deletes your cookies, history, and site data when you close all your private tabs. %2$s
ug: بارلىق شەخسىيەت بەتكۈچلەر تاقالغاندا %1$s سىزنىڭ cookies، تارىخ ۋە تور بېكەت سانلىق مەلۇماتلىرىڭىزنى ئۆچۈرىدۇ. %2$s

source: %1$s deletes your cookies, history, and site data when you close all your private windows. %2$s
ug: بارلىق شەخسىيەت كۆزنەكلىرى تاقالغاندا %1$s سىزنىڭ cookies، تارىخ ۋە تور بېكەت سانلىق مەلۇماتلىرىڭىزنى ئۆچۈرىدۇ. %2$s

source: %1$s extensions
ug: %1$s كېڭەيتىلمە

source: %1$s has a new update
ug: %1$sنىڭ يېڭىلانمىسى بار

source: %1$s has been added to %2$s
ug: %2$s غا %1$s قوشۇلدى

source: %1$s has been disabled due to security or stability issues.
ug: بىخەتەرلىك ياكى مۇقىملىق مەسىلىسى سەۋەبىدىن %1$s چەكلەنگەن.

source: %1$s is not compatible with your version of %2$s (version %3$s).
ug: سىز ئىشلىتىۋاتقان نەشرى %2$s (%3$s نەشرى) بىلەن %1$s ماسلاشمايدۇ.

source: %1$s is produced by Mozilla.
ug: %1$s نى Mozilla ياسىغان.

source: %1$s is requesting your username and password.
ug: %1$s ئىشلەتكۈچى ئىسمى بىلەن ئىمنى تەلەپ قىلىۋاتىدۇ.

source: %1$s just refused cookies for you
ug: %1$s سىز ئۈچۈن ساقلانمىنى رەت قىلدى

source: %1$s may install and run studies from time to time.
ug: %1$s پات-پات تەتقىقاتلارنى ئورنىتىپ ئىجرا قىلالايدۇ.

source: %1$s on %2$s %3$s
ug: %2$s %3$s دىكى %1$s

source: %1$s open tabs. Tap to switch tabs.
ug: %1$s بەتكۈچ ئوچۇق. بەتكۈچنى ئالماشتۇرۇش ئۈچۈن چېكىڭ.

source: %1$s out of 5 stars
ug: %1$s يۇلتۇز (يۇقىرىسى 5 يۇلتۇز )

source: %1$s (Private Mode)
ug: %1$s (شەخسىي ھالەت)

source: %1$s requests additional permissions.
ug: %1$s قوشۇمچە ئىجازەت تەلەپ قىلىدۇ.

source: %1$s tabs closed: %2$d
ug: %1$s بەتكۈچ تاقالدى: %2$d

source: %1$s tries to automatically reject all cookie requests on supported sites.
ug: %1$s قوللايدىغان تور بېكەتلەرنىڭ بارلىق ساقلانما تەلەپلىرىنى ئاپتوماتىك رەت قىلىشنى سىنايدۇ.

source: %1$s violates Mozilla’s policies and can’t be installed.
ug: «%1$s» Mozilla نىڭ تۈزۈمىگە خىلاپلىق قىلغاچقا ئورناتقىلى بولمايدۇ.

source: %1$s violates Mozilla’s policies and can’t be installed on %2$s.
ug: %2$s دىكى Mozilla نىڭ %1$s تۈزۈمىگە خىلاپلىق قىلغاچقا ئورناتقىلى بولمايدۇ.

source: %1$s will clear this site’s cookies and refresh the page. Clearing all cookies may sign you out or empty shopping carts.
ug: %1$s بۇ تور بېكەتنىڭ ساقلانمىسىنى تازىلاپ بەتنى يېڭىلايدۇ. بارلىق ساقلانمىلار تازىلانسا سىز تىزىمدىن چىقىپ كېتىشىڭىز ياكى مال ھارۋىسى بوشىتىلىشى مۇمكىن.

source: %1$s will never offer to translate sites in this language.
ug: %1$s بۇ تىلدىكى تور بېكەتلەرنى تەرجىمە قىلىش تەكلىپىنى ھەرگىز سۇنمايدۇ.

source: %1$s will offer to translate sites in this language.
ug: %1$s بۇ تىلدىكى تور بېكەتلەرنى تەرجىمە قىلىش تەكلىپى سۇنىدۇ.

source: %1$s will translate this language automatically when the page loads.
ug: بەت يۈكلەنگەندە %1$s بۇ تىلنى ئاپتوماتىك تەرجىمە قىلىدۇ.

source: %2$s is requesting your username and password. The site says: “%1$s”
ug: %2$s ئىشلەتكۈچى ئىسمى بىلەن ئىمنى تەلەپ قىلىۋاتىدۇ. تور بېكەتتە دېيىلگىنى: «%1$s»

source: 2. Tap <b>Permissions</b>
ug: 2. <b>ئىجازەت</b> نى چېكىڭ

source: 3. Toggle <b>%1$s</b> to ON
ug: 3. <b>%1$s</b> نى ئوچۇققا ئالماشتۇرۇڭ

source: About %1$s
ug: ھەققىدە %1$s

source: About translations in %1$s
ug: %1$s تەرجىمىسى ھەققىدە

source: Accept and edit suggestion
ug: تەكلىپنى قوبۇل قىلىپ تەھرىرلەيدۇ

source: Accept the Risk and Continue
ug: خەتەرنى قوبۇل قىلىپ داۋاملاشتۇرۇش

source: Access %1$s from the %2$s menu.
ug: %2$s تىزىملىكىدىن %1$s نى زىيارەت قىلىڭ.

source: Access browser activity during navigation
ug: زىيارەت جەريانىدا توركۆرگۈ پائالىيەتلىرىگە ئېرىشەلەيدۇ

source: Access browser tabs
ug: توركۆرگۈ بەتكۈچلىرىنى زىيارەت قىلىش

source: Access browsing history
ug: توركۆرگۈ تارىخىغا ئېرىشىدۇ

source: Accessibility
ug: قۇلايلىقلار

source: Access recently closed tabs
ug: يېقىندا يېپىلغان بەتكۈچلەرگە ئېرىشىدۇ

source: Access to the file was denied
ug: ھۆججەتنى زىيارەت قىلىش رەت قىلىندى

source: Access your data for %1$s
ug: %1$s ئۈچۈن سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىدۇ

source: Access your data for all websites
ug: ھەممە تور بېكەتلەردىكى سانلىق مەلۇماتلىرىڭىزغا ئېرىشىدۇ

source: Access your data for sites in the %1$s domain
ug: بۇ %1$s دائىرىدىكى تور بېكەت ئۈچۈن سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىدۇ

source: Access your data on %1$d other domains
ug: باشقا %1$d دائىرىدىكى سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىدۇ

source: Access your data on %1$d other sites
ug: باشقا %1$d تور بېكەتتىكى سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىدۇ

source: Access your data on 1 other domain
ug: باشقا بىر دائىرىدىكى سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىدۇ

source: Access your data on 1 other site
ug: باشقا بىر تور بېكەتتىكى سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىدۇ

source: Access your location
ug: ئورنىڭىزغا ئېرىشىدۇ

source: Account info
ug: ھېسابات ئۇچۇرى

source: Account picture
ug: ھېسابات رەسىمى

source: Account settings
ug: ھېسابات تەڭشىكى

source: Active
ug: ئاكتىپ

source: Ad blocker
ug: ئېلان توسقۇچ

source: Ad by %s
ug: ئېلان بەرگۈچى %s

source: Add
ug: قوشۇش

source: Add %1$s
ug: %1$s نى قوشۇش

source: Add %1$s?
ug: %1$s نى قوشامسىز؟

source: Add %1$s and %2$s to %3$s
ug: %1$s ۋە %2$s نى %3$s غا قوش

source: Add %1$s to %2$s
ug: %1$s نى %2$s غا قوش

source: Add add-on button
ug: قوشۇلما توپچە قوش

source: Add address
ug: ئادرېس قوش

source: Add a fake login for this domain
ug: بۇ تور دائىرىسىگە ساختا كىرىش ئۇچۇرى قوش

source: Add a name
ug: ئات قوش

source: Add a new folder
ug: يېڭى قىسقۇچ قوش

source: Add app to Home screen
ug: ئەپنى باش ئېكرانغا قوش

source: Add app to Home screen…
ug: ئەپنى باش ئېكرانغا قوش…

source: Add bookmarks as you browse so you can find your favorite sites later.
ug: زىيارەت قىلىۋاتقاندا خەتكۈچكە قوشسىڭىز كېيىن ياقتۇرغان تور بېكەتلىرىڭىزنى تاپالايسىز.

source: Add bookmark, Shortcut, Home, Collection, PDF
ug: خەتكۈچ، تېزلەتمە، باش بەت، توپلام، PDF قوشىدۇ

source: Add card
ug: كارتا قوش

source: Add credit card
ug: ئىناۋەتلىك كارتا قوش

source: Added to shortcuts!
ug: تېزلەتمىگە قوشۇلدى!

source: Add extension
ug: كېڭەيتىلمە قوش

source: Add Firefox widget
ug: Firefox ئەپچە قوش

source: Add folder
ug: قىسقۇچ قوش

source: Add login
ug: كىرىشنى قوش

source: Add new collection
ug: يېڭى يىغقۇچ قۇر

source: Add new login
ug: يېڭى كىرىش قوش

source: Add new search engine
ug: يېڭى ئىزدەش موتورى قوش

source: Add-on collection modified. Quitting the application to apply changes…
ug: قوشۇلما توپلىمى ئۆزگەرتىلدى. پىروگراممىنىڭ ئۆزگەرتىش ئىلتىماسىدىن ۋاز كېچىۋاتىدۇ…

source: Add-on icon
ug: قوشۇلما سىنبەلگىسى

source: Add-on is already installed
ug: قوشۇلما ئورنىتىلغان

source: Add-on is not supported
ug: قوشۇلمىنى قوللىمايدۇ

source: Add-ons
ug: قىستۇرمىلار

source: Add-ons are temporarily disabled
ug: قوشۇلما ۋاقىتلىق چەكلەنگەن

source: Add-ons Manager
ug: قىستۇرما باشقۇرغۇچ

source: Add-ons, navigate up
ug: قوشۇلما، ئۈستىگە يول باشلا

source: Add-on updates
ug: قىستۇرما يېڭىلانمىلىرى

source: Add password
ug: ئىم قوش

source: Add private browsing shortcut
ug: شەخسىي تور زىيارەت قىسقا يولى قوش

source: Add private tab
ug: شەخسىي بەتكۈچ قوش

source: Address bar
ug: ئادرېس ستونى

source: Address bar - Firefox Suggest
ug: ئادرېس بالدىقى - Firefox تەكلىپى

source: Address bar location
ug: ئادرېس بالداق ئورنى

source: Address bar preferences
ug: ئادرېس بالداق مايىللىقى

source: Addresses
ug: ئادرېس

source: Address Not Found
ug: ئادرېس تېپىلمىدى

source: Add search engine
ug: ئىزدەش موتورى قوش

source: Add tab
ug: بەتكۈچ قوش

source: Add them to %1$s
ug: ئۇلارنى%1$s غا قوشىدۇ

source: Add third-party extensions to enhance your security, productivity, and more.
ug: ئۈچىنچى تەرەپ كېڭەيتىلمىسىنى قوشۇپ، بىخەتەرلىك، ئۈنۈمدارلىق ۋە باشقىلارنى ياخشىلايسىز.

source: Add to active tabs
ug: ئاكتىپ بەتكۈچكە قوش

source: Add to contact
ug: ئالاقەداشقا قوش

source: Add to Home screen
ug: باش ئېكرانغا قوش

source: Add to Home screen…
ug: باش ئېكرانغا قوش…

source: Add to inactive tabs
ug: ئاكتىپسىز بەتكۈچكە قوش

source: Add to private tabs
ug: شەخسىي بەتكۈچكە قوش

source: Add to shortcuts
ug: تېزلەتمىگە قوش

source: Add username to saved password?
ug: ساقلانغان ئىمغا ئىشلەتكۈچى ئاتىنى قوشامدۇ؟

source: Adjusted rating
ug: تەڭشەلگەن باھا

source: Advanced
ug: ئالىي

source: Advanced…
ug: ئالىي…

source: After one day
ug: بىر كۈندىن كېيىن

source: After one month
ug: بىر ئايدىن كېيىن

source: After one week
ug: بىر ھەپتىدىن كېيىن

source: All actions
ug: بارلىق مەشغۇلات

source: All cookies (will cause websites to break)
ug: بارلىق Cookies (تور بېكەتلەرنىڭ بۇزۇلۇشىنى كەلتۈرۈپ چىقىرىدۇ)

source: All languages
ug: بارلىق تىللار

source: Allow
ug: يول قوي

source: ALLOW
ug: يول قوي

source: Allow %1$s to open %2$s
ug: %1$s نىڭ %2$s نى ئېچىشىغا يول قويىدۇ

source: Allow %1$s to play DRM-controlled content?
ug: DRM تىزگىنلىنىدىغان مەزمۇننى %1$s نىڭ قويۇشىغا يول قويامدۇ؟

source: Allow %1$s to reject cookie banners?
ug: %1$s نىڭ cookie لوزۇنكىسىنى رەت قىلىشىغا يول قويامدۇ؟

source: Allow %1$s to send notifications?
ug: %1$s نىڭ ئۇقتۇرۇش ئەۋەتىشىگە يول قويامدۇ؟

source: Allow %1$s to store data in persistent storage?
ug: %1$s سانلىق مەلۇماتلارنى ئىزچىل ساقلىشىغا يول قويامدۇ؟

source: Allow %1$s to use its cookies on %2$s?
ug: %2$s دىكى cookies نى %1$s نىڭ ئىشلىتىشىگە يول قويامدۇ؟

source: Allow %1$s to use your camera?
ug: %1$s كامېرايىڭىزنى ئىشلىتىشىگە يول قويامسىز؟

source: Allow %1$s to use your camera and microphone?
ug: %1$s كامېرا ۋە مىكروفونىڭىزنى ئىشلىتىشىگە يول قويامسىز؟

source: Allow %1$s to use your location?
ug: %1$s ئورنىڭىزنى ئىشلىتىشىگە يول قويامسىز؟

source: Allow %1$s to use your microphone?
ug: %1$s مىكروفونىڭىزنى ئىشلىتىشىگە يول قويامسىز؟

source: Allow audio and video
ug: ئۈن ۋە سىنغا يول قوي

source: Allowed
ug: يول قويغان

source: Allow for all sites
ug: ھەممە تور بېكەتكە يول قويىدۇ

source: Allow in private browsing
ug: شەخسىي زىيارەت ھالىتىگە يول قويىدۇ

source: Allow screenshots in private browsing
ug: شەخسىي تور زىيارەتتە ئېكران كەسمىسىگە يول قويىدۇ

source: Allow search suggestions in private sessions?
ug: شەخسىي سۆزلىشىشتە ئىزدەش تەۋسىيەسىگە يول قويامدۇ؟

source: Allows Mozilla to install and run studies
ug: Mozilla نىڭ تەتقىقاتىنى ئورنىتىپ ۋە ئىجرا قىلىشىغا يول قويىدۇ

source: Allow unverified third-party scripts to access your data
ug: دەلىللەنمىگەن ئۈچىنچى تەرەپ قوليازمىلىرىنىڭ سانلىق مەلۇماتلىرىڭىزنى زىيارەت قىلىشىغا يول قويىدۇ

source: All third-party cookies (may cause websites to break)
ug: بارلىق ئۈچىنچى تەرەپ Cookies (تور بېكەتلەرنىڭ بۇزۇلۇشىنى كەلتۈرۈپ چىقىرىشى مۇمكىن)

source: A login with that username already exists
ug: بۇ ئىشلەتكۈچى ئىسمىدىكى كىرىش مەۋجۇت

source: Always
ug: ھەمىشە

source: Always download in data saving mode
ug: سانلىق مەلۇمات تېجەش ھالىتىدە ھەمىشە چۈشۈرىدۇ

source: Always download languages in data saving mode
ug: سانلىق مەلۇمات تېجەش ھالىتىدە ھەمىشە تىلنى چۈشۈرىدۇ

source: Always offer to translate
ug: ھەمىشە تەرجىمە تەكلىپى بەر

source: Always request desktop site
ug: ھەمىشە ئۈستەل ئۈستى تور بېكىتىنى ئىلتىماس قىلىدۇ

source: Always translate
ug: ھەمىشە تەرجىمە قىلسۇن

source: Always translate %1$s
ug: %1$s نى ھەمىشە تەرجىمە قىلسۇن

source: Analysis is up to date
ug: ئەڭ يېڭى تەھلىل

source: A new permission is required
ug: يېڭى ئىجازەت تەلەپ قىلىنىدۇ

source: Anti-tracking gem. Stop invisible trackers and spying ads.
ug: ئىزلاشقا قارشى قورال. كۆرۈنمەيدىغان ئىزلىغۇچى ۋە جاسۇسلۇق ئېلانلىرىنى توختىتىدۇ.

source: Apr
ug: ئاپرېل

source: Are these reviews reliable? Check now to see an adjusted rating.
ug: بۇ باھالىنىش ئىشەنچلىكمۇ؟ تەڭشەلگەن باھانى كۆرۈپ بېقىڭ.

source: Are you sure?
ug: جەزملەشتۈرەمسىز؟

source: Are you sure that you want to clear all the cookies and data for the site <b>%s</b>?
ug: بۇ <b>%s</b> تور بېكەتنىڭ بارلىق cookies ۋە سانلىق مەلۇماتلىرىنى راستىنلا تازىلامسىز؟

source: Are you sure that you want to clear all the permissions for this site?
ug: بۇ تور بېكەتتىكى ھەممە ئىجازەتلەرنى راستىنلا ئۆچۈرەمسىز؟
